{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 32, 32, 1]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [4, 4], "activation": "linear", "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 64, "use_bias": true, "name": "conv2d_1", "batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.800000011920929, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "Conv2D", "config": {"kernel_size": [4, 4], "activation": "linear", "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "name": "conv2d_2", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "Conv2D", "config": {"kernel_size": [4, 4], "activation": "linear", "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "name": "conv2d_3", "padding": "same", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}], "name": "sequential_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["sequential_1", 1, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_4", "padding": "same", "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv2d_4", "inbound_nodes": [[["sequential_1", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"trainable": true, "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "name": "dense_1", "bias_constraint": null, "units": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "output_layers": [["conv2d_4", 0, 0], ["dense_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.1.4"}