{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 32, 32, 1]}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_5", "padding": "same", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2]}, "name": "conv2d_5", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.20000000298023224}, "name": "leaky_re_lu_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_6", "padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2]}, "name": "conv2d_6", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}, "name": "leaky_re_lu_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "momentum": 0.8, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_1", "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_7", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2]}, "name": "conv2d_7", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.20000000298023224}, "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "momentum": 0.8, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_2", "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_8", "padding": "same", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2]}, "name": "conv2d_8", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.20000000298023224}, "name": "leaky_re_lu_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "momentum": 0.8, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_3", "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_1", "data_format": "channels_last"}, "name": "up_sampling2d_1", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_9", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv2d_9", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "momentum": 0.8, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_4", "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_2", "data_format": "channels_last"}, "name": "up_sampling2d_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_10", "padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv2d_10", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "momentum": 0.8, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_5", "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_2"}, "name": "concatenate_2", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_3", "data_format": "channels_last"}, "name": "up_sampling2d_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_11", "padding": "same", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv2d_11", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "momentum": 0.8, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_6", "gamma_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_3"}, "name": "concatenate_3", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_4", "data_format": "channels_last"}, "name": "up_sampling2d_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"trainable": true, "activation": "tanh", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "use_bias": true, "name": "conv2d_12", "padding": "same", "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv2d_12", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}], "output_layers": [["conv2d_12", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]]}, "keras_version": "2.1.4"}