{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.4", "config": {"output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "name": "discriminator_classifier", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential", "name": "sequential_1", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "padding": "same", "name": "conv2d_1", "strides": [2, 2], "filters": 16, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv2d_2", "strides": [2, 2], "filters": 32, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "name": "zero_padding2d_1", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv2d_3", "strides": [2, 2], "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv2d_4", "strides": [1, 1], "filters": 128, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}]}, {"inbound_nodes": [[["sequential_1", 1, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"name": "dense_1", "units": 1, "kernel_constraint": null, "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"inbound_nodes": [[["sequential_1", 1, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"name": "dense_2", "units": 10, "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}]}}