{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.4", "config": {"output_layers": [["sequential_2", 1, 0]], "name": "generator", "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_3", "config": {"dtype": "int32", "batch_input_shape": [null, 1], "sparse": false, "name": "input_3"}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_1", "config": {"dtype": "float32", "batch_input_shape": [null, null], "input_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "name": "embedding_1", "output_dim": 100, "trainable": true, "mask_zero": false, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "input_length": null}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"dtype": "float32", "batch_input_shape": [null, 100], "sparse": false, "name": "input_2"}}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_1", "config": {"name": "multiply_1", "trainable": true}}, {"inbound_nodes": [[["multiply_1", 0, 0, {}]]], "class_name": "Sequential", "name": "sequential_2", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "batch_input_shape": [null, 100], "kernel_regularizer": null, "name": "dense_3", "units": 6272, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "Reshape", "config": {"target_shape": [7, 7, 128], "name": "reshape_1", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv2d_5", "strides": [1, 1], "filters": 128, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "data_format": "channels_last", "size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv2d_6", "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "momentum": 0.8, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv2d_7", "strides": [1, 1], "filters": 1, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_3", "trainable": true}}]}]}}